{"inkVersion":21,"root":[[{"->":"Masturbation"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"Masturbation":["^I don't know if it was me getting cold feet, or it was something about the door, but I couldn't bring myself to enter.","\n","^My legs were shaking and my heart was racing too much to think about what else to do.","\n","^Did you really walk up to this house just to not enter? ","#","^Speaker Tattoo","/#","\n","^It's... just a bad preminition. W-what if it's the dream of some evil entity that wants to trap me in a red cabin for 25 years?! ","#","^Speaker Nova","/#","\n","^Ugh. Guess I'll see you again when you're done going into heat. ","#","^Speaker Tattoo","/#","\n","^Right as I heard the voice stop, I felt that same raging fire burst from within me again.","\n","^It was radiating from the tattoo and creeping throughout my body.","\n","^It felt as though there were hands stroking me from every possible angle at the same time as my skin grew more sensitive.","\n","^Reaching between my legs, even my hands were nearly numb from the pleasure as I tried to finish myself off to no avail.","\n","^No matter how much I would rub, flick, or finger myself, nothing would send me over the edge. I just felt closer and closer with no release in sight.","\n","^I was moaning and nearly screaming from how intense the pleasure was but nothing would calm it down.","\n","^My mind had gotten foggy, my arms were tired, and my legs could barely keep me upright. ","#","^background next","/#","\n","^I was begging my body to let me finally cum but it wouldn't let me.","\n","^The denial started to feel good. If I couldn't cum, then I could just lose myself in this pleasure...","\n","^It was a feeling I had never considered before. Remaining on the edge forever as my body was flooded with an unending pleasure that I couldn't fight.","\n","^My body had stopped being mine and was simply a slave to itself.","\n","^By the time I could think straight again, I was quivering on the ground. The heat had finally subsided and my thoughts could keep themselves together once again.","\n","^Morning, sunshine. ","#","^Speaker Tattoo","/#","\n","^How... long was I... ","#","^Speaker Nova","/#","\n","^I didn't keep track and didn't care to. I told you what would happen when we started, remember? ","#","^Speaker Tattoo","/#","\n","^Yeah... but this time... it felt better~ ","#","^Speaker Nova","/#","\n","^Hey! No gooning on the job! Got it?! I need your brain working if you want to get out of this situation. ","#","^Speaker Tattoo","/#","\n","^R-right. Just.. give me a little bit to catch my breath. ","#","^Speaker Nova","/#","\n","^Still...","\n","^If it felt better this time... maybe there is something fun about a little bit of denial...","\n","done",{"#f":1}],"#f":1}],"listDefs":{}}