{"inkVersion":21,"root":[[{"->":"Paizuri"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"Paizuri":["^When I opened my eyes, my vision was blocked by a set of horns and a tuft of fur just below them.","\n","^My hand was on her wrist while the other held just under her breast.","\n","^I could feel her heart racing while my breast pressed into her back. She was shaking with confusion but, I could also feel her leaning into me.","\n","^Her arm was between my breast, almost trapping her in my bossom.","\n","^I gently stroked up and down her stomach. Each finger made her tremble before she got more and more used to my skin against her's.","\n","^She was warm. Her skin was tender and her chest only grew hotter as my chest pushed into her.","\n","^Reaching further down, her excitement was clear as day. It was twitching with every touch.","\n","^Gently, I sat her down and spread her legs. She was blushing bright red and sat with her back straight. Her bare chest made it easy to see her heart nearly leaping out of her chest.","\n","^I licked my lips as I wrapped my breasts around her cock. It vanished instantly from sight, but I could feel it throbbing happily between them.  ","#","^background next","/#","\n","^Her lips were sealed tight and her arms were straight down to her sides. It was as if she feared getting in trouble just for moaning or reaching out to touch me.","\n","^It was precious.","\n","^I gently rolled my breasts together with her between them. I could feel each and every twitch as their lips trembled.","\n","^Her eyes kept jumping between looking at my breasts and my face. Her breathing was getting faster as her eyes became more undecided.","\n","^I felt her leaking more and more pre-cum as I pressed my breasts into her thighs. I wondered just how much spoiling she could take before I could hear her sweet pleas for more.","\n","^My breasts lifted up and down slowly as her pre worked as lubricant. Gently coating her cock as it glided between my chest.","\n","^Feeling the entirety of her cock between my breasts was starting to excite me more and more. It felt powerful to make something so excited and eager just dissappear from sight while feeling it enjoy its newfound captivity.","\n","^I wanted to see just how much more she could take before giving in and finally letting go.","\n","^I pumped my breasts up and down along her throbbing cock. Mashing my breasts into her upper thighs just to let the top peak through. ","#","^background next","/#","\n","^I could see its veins bulging out just below her tip. Just a single lick could have sent her over the edge, but I wanted more.","\n","^The way it leaked and throbbed against my heavy breasts made it harder and harder not to just wrap my lips around it.","\n","^It was almost as cute as her face.","\n","^Each pulse felt more desperate than the last. She was barely keeping it all in. From her moans to her non-stop throbbing, I could feel how badly she wanted to cum.","\n","^It would have been so easy to just breath on it and feel that exact moment her body gave in. I wanted to hear her beg for my breasts and for me to finish her off, but she seemed too focused on trying to make the moment last forever.","\n","^I stopped for a moment and looked right at her shocked face. Her lips couldn't stop shaking as she tried to find the exact words she wanted. It was right on the tip of her tonuge, underneath her hot breath.","\n","^Just as her tongue flicked, I leaned closer to her leaking head and give it a tiny peck.","\n","^Chuu~~","\n","^I pulled my head back just before she went off. ","#","^background next","/#","\n","^Her hands were covering her face as her hips bucked with each warm rope that shot out. I stuck my tongue out to catch any of it as it flew into the air.","\n","^Some shot off into different directions, raining down onto the ground with a moist thud. The few that landed on my tongue were too sweet not to savor.","\n","^Even for as large as her cock felt, bulging and throbbing relentlessly, it couldn't ever hope to be released without my choice.","\n","^After the last few drops finally pittered out and covered the top of my chest, I finally let go of my breasts. Allowing them to rest on her legs and for her cock to fall back onto her with a cute thwack.","\n","^Her body soon fell back as well, and her breathing steadied as she drifted off to sleep.","\n","^You don't need to swallow it, you know? ","#","^Speaker Tattoo","/#","\n","^How could I not? I have a sweet tooth. And her pixie stick was too irresistable! ","#","^Speaker Nova","/#","\n","^Don't come crying to me if your foot starts feeling weird then... ","#","^Speaker Tattoo","/#","\n","done",{"#f":1}],"#f":1}],"listDefs":{}}