{"inkVersion":21,"root":[[{"->":"dream"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"dream":["^At the far end of the hallway, there was a pink shimmering light. Each step towards the light was met with a growing warmth that crept up my body as if welcoming me to myself.","\n","^As I got closer to the light, the warmth became all consuming. It filled my throat, my breasts, and began slithering between my legs. My legs were barely able to keep myself up as I tried to continue.","\n","^The once gentle warmth grew into an all consuming flame that held me to the ground. Nowhere I could reach on my own body would cause this sensation to cease. Yet, in the very same helpless breath, I never once thought to push against it.","\n","^The flame inside me felt too good to resist...","\n",{"->":"wakeup"},{"->":"wakeup"},{"#f":1}],"wakeup":[["^h...y.... ou....up! ","#","^Speaker Tattoo","/#","\n","ev","str","^H-huh? Is someone calling for me?","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Five more minutes... I don't wanna go to class yet...","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n","^Can... even hear me...? ","#","^Speaker Tattoo","/#","\n",[["^I think its getting clearer...","\n",{"->":"wakeup.0.g-0"},{"#f":5,"#n":"g-0"}],null],{"#f":5}],"c-1":["\n","^I'm... your professor...! ","#","^Speaker Tattoo","/#","\n",["ev","str","^Try to go back to sleep","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Sleep through your responsibilites","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^You're not going to stand me up! ","#","^Speaker Tattoo","/#","\n",{"->":"wakeup.0.g-0"},{"#f":5}]}],{"#f":5}],"g-0":["^I said wake up! ","#","^Speaker Tattoo","/#","\n",{"->":"introductions"},{"#f":5}]}],{"#f":1}],"introductions":["^Fine fine! I'm awake, I'm awake... *yawn ","#","^Speaker Nova","/#","\n","^Huh? I know I heard someone but there's nobody here... ","#","^Speaker Nova","/#","\n","^Wait! Why would there be someone in my room at... 1am?! I don't have any roommates anymore... ","#","^Speaker Nova","/#","\n","^Personally, I prefer the term womb mate but we can work that out later. ","#","^Speaker Tattoo","/#","\n","^Who said that?! ","#","^Speaker Nova","/#","\n","^Look down! ","#","^Speaker Tattoo","/#","\n","^Who gave me a tattoo in the middle of the night?! And... it's talking to me? ","#","^Speaker Nova","/#","\n","^Not talking. Communicating? Yes. But be happy I don't have a mouth down here. ","#","^Speaker Tattoo","/#","\n","^What are you doing?! I'm not some cheap water tattoo! Stop rubbing me like I'm gonna come out! You're only going to... ","#","^Speaker Tattoo","/#","\n","^Before I could hear the rest, a sharp ping shot straight to my brain and I was back on my bed with my legs twitching.","\n","^It was the same warmth from my dream, but instead of a flame, it was a full blown inferno coursing through me.","\n","^Why am I... so horny.. ","#","^Speaker Nova","/#","\n","^Do you mean up top or how you're making a puddle in your bed? ","#","^Speaker Tattoo","/#","\n","^Ouch... why are they so pointy? When did I get horns?! Did you do this?! ","#","^Speaker Nova","/#","\n","^Yes and no. We can sweat over the details later but, right now, you should get on the street. If you can even feel your legs, that is. ","#","^Speaker Tattoo","/#","\n","^Shouldn't I get dressed? It's cold outside this late. ","#","^Speaker Nova","/#","\n","^1. You are dressed. 2. I'm the one keeping you warm, if you haven't noticed already. Now get to it! ","#","^Speaker Tattoo","/#","\n","^Begrudgingly, I started making my way to the lobby. I had the feeling it would be a long night...","\n",{"->":"lobby"},{"#f":1}],"lobby":[["^So, are you going to tell me what's going on here? ","#","^Speaker Nova","/#","\n","^Do you want the short answer or the long one? ","#","^Speaker Tattoo","/#","\n","ev","str","^Short answer","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Long answer","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n","^I need you to suck cum so we can leave. ","#","^Speaker Tattoo","/#","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","^I need you to extract essence from potent targets. If you don't, that feeling from trying to rub me out is going to drown your senses until you're a drooling mess. ","#","^Speaker Tattoo","/#","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^There's your answer. ","#","^Speaker Tattoo","/#","\n","^That... doesn't explain a lot... ","#","^Speaker Nova","/#","\n","^Ugh! You ever heard of a succubus before? Like that popular one you see in video games a lot. ","#","^Speaker Tattoo","/#","\n","^You mean Maroogan? ","#","^Speaker Nova","/#","\n","^Yeah. Her. She's similar to how they work but clearly with some... liberties... taken from the real deal. Just think of it as a cosplay that lets you actually do what her job is. ","#","^Speaker Tattoo","/#","\n","^But without the accent and large wings? ","#","^Speaker Nova","/#","\n","^Some of them have both. Not specifically scottish, but that's what happens when your kind spread out across the world over the course of a millennia. All of them have the same job though: Extract essence. ","#","^Speaker Tattoo","/#","\n","^But then, why do I feel really good without doing anything? ","#","^Speaker Nova","/#","\n","^It's like a shock collar, young pup. You get to feel good but you can't release unless it's done while extracting. Meaning, your brain goes full on goon mode while taking away the key to let you release. ","#","^Speaker Tattoo","/#","\n","^Some would consider it a curse. To others, maybe a blessing. Point being, it's meant to make your work feel good by force. ","#","^Speaker Tattoo","/#","\n","^So do you want to actually get this thing started or do you want to be trapped in a horny prison with no release for literally ever? ","#","^Speaker Tattoo","/#","\n","^When you put it that way... ","#","^Speaker Nova","/#","\n","^STREET! NOW! ","#","^Speaker Tattoo","/#","\n","^I'm going! I'm going! ","#","^Speaker Nova","/#","\n",{"->":"Street"},{"#f":5}]}],{"#f":1}],"Street":["^It really isn't that cold outside... I should be freezing right now but I feel so... ","#","^Speaker Nova","/#","\n","^You're welcome. Now look alive. You have some friends out here. ","#","^Speaker Tattoo","/#","\n","^What?! You never said anything about monsters out here! ","#","^Speaker Nova","/#","\n","^If I did, would you have really stepped outside? ","#","^Speaker Tattoo","/#","\n","^I wanna go back! I only took a self-defense class a few times! My mace is still in my purse! ","#","^Speaker Nova","/#","\n","^Relax. Just flick your wrist at them. It'll work better than any mace or baton you keep on you. I'm more than just some pocket warmer. ","#","^Speaker Tattoo","/#","\n","^Humans refer to them as paralysis demons but they're more like stray figments of imagination. They nestle in corners of your brain and come out at night looking for essence as well. Just in a far more brutish way. ","#","^Speaker Tattoo","/#","\n","^So... they want the same thing as us? ","#","^Speaker Nova","/#","\n","^Firstly: Don't group me with you. Second: No. They like to snack on essence to maintain their forms. The more they snack, the stronger they get. They don't like succubi since they take essence and leave. Figments can sense a general area where a potent essence source is, but they can't pinpoint exactly where. ","#","^Speaker Tattoo","/#","\n","^They also aren't a bad source of essence themselves, but they aren't as potent. Meaning its more dangerous and effort to extract from them than from a potent source. Still useful, but not the main goal. ","#","^Speaker Tattoo","/#","\n","^I think I understand... I'm ready to give this a go! ","#","^Speaker Nova","/#","\n","^Alright. Let's try to find that source nearby. Shouldn't be too far for you. ","#","^Speaker Tattoo","/#","\n","done",{"#f":1}],"#f":1}],"listDefs":{}}